import IconCircle from "@/components/iconCircle"
import Link from "next/link"

function PrivacyPolicyPage() {
  return (
    <div className="bg-home flex h-full w-full flex-col gap-8 p-32 text-white">
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">1. นโยบายความเป็นส่วนตัว (Privacy Policy)</h1>
        <p className="text-body-1">
          การแข่งขันเขียนโปรแกรมคอมพิวเตอร์ BangMod Hackathon 2025
          ให้ความสําคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ
          โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลรวมถึงสิทธิต่าง ๆ ของเจ้าของข้อมูลส่วนบุคคล
          ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">2. การเก็บรวบรวมข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">เราจะเก็บข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทาง ดังต่อไปนี้</p>
        <li className="text-body-1 list-disc">การรับสมัครเข้าร่วมโครงการบนหน้าเว็บไซต์</li>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">3. ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม</h1>
        <ul className="text-body-1 list-disc pl-6">
          <li>ข้อมูลส่วนบุคคล เช่น ชื่อ นามสกุล อายุ วัน/เดือน/ปีเกิด สัญชาติ เลขประจำตัวประชาชน เป็นต้น</li>
          <li>ข้อมูลการติดต่อ เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล เป็นต้น</li>
          <li>ข้อมูลบัญชี เช่น บัญชีผู้ใช้งาน ประวัติการใช้งาน เป็นต้น</li>
          <li>หลักฐานแสดงตัวตน เช่น สำเนาบัตรประจำตัวประชาชน เอกสารรับรองการเป็นนักเรียน เป็นต้น</li>
          <li>
            ข้อมูลอื่น ๆ เช่น
            รูปภาพและข้อมูลอื่นใดที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล เราจะเก็บรวบรวม
            ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว ดังต่อไปนี้ เมื่อเราได้รับความยินยอมโดยชัดแจ้งจากคุณ
            เว้นแต่กฎหมายกำหนดให้ทำได้
          </li>
          <li>ข้อมูลสุขภาพ</li>
        </ul>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">4. ผู้เยาว์</h1>
        <p className="text-body-1">
          หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจํากัดความสามารถตามกฎหมาย เราอาจเก็บรวบรวม ใช้
          หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ
          เราอาจจําเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทําได้
          หากเราทราบว่ามีการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง
          เราจะดําเนินการลบข้อมูลนั้นออกจากฐานข้อมูลของเรา
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">5. วิธีการเก็บรักษาข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">6. การประมวลผลข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์ดังต่อไปนี้
        </p>
        <ul className="text-body-1 list-disc pl-6">
          <li>เพื่อยืนยันว่าผู้สมัครมีตัวตนจริง</li>
          <li>เพื่อใช้ประกอบการพิจารณาคุณสมบัติของผู้สมัครตามที่โครงการกำหนด</li>
          <li>เพื่อปฏิบัติตามกฎหมายและกฎระเบียบของหน่วยงานราชการ</li>
        </ul>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">7. การเปิดเผยข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็นให้เจ้าหน้าที่ภายในโครงการภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้
          เพื่อการบริหารจัดการโครงการอย่างมีประสิทธิภาพ
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">8. ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จําเป็นสำหรับการบรรลุวัตถุประสงค์ตามนโยบายนี้
          ซึ่งอาจจําเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกําหนดไว้เราจะลบ ทําลาย
          หรือทําให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ เมื่อหมดความจําเป็นหรือสิ้นสุดระยะเวลาดังกล่าว
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">8. ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จําเป็นสำหรับการบรรลุวัตถุประสงค์ตามนโยบายนี้
          ซึ่งอาจจําเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกําหนดไว้เราจะลบ ทําลาย
          หรือทําให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ เมื่อหมดความจําเป็นหรือสิ้นสุดระยะเวลาดังกล่าว
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">9. สิทธิของเจ้าของข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">ภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล คุณมีสิทธิในการดำเนินการดังต่อไปนี้</p>
        <ul className="text-body-1 list-disc pl-6">
          <li>
            <b>สิทธิขอถอนความยินยอม (Right to withdraw consent):</b> หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม
            ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ
            ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น
            คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา
          </li>
          <li>
            <b>สิทธิขอเข้าถึงข้อมูล (Right to access):</b>{" "}
            คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเราและขอให้เราทำสําเนาข้อมูลดังกล่าวให้แก่คุณ
            รวมถึงขอให้เราเปิดเผยว่าเราได้ข้อมูลส่วนบุคคลของคุณมาได้อย่างไร
          </li>
          <li>
            <b>สิทธิขอถ่ายโอนข้อมูล (Right to data portability):</b>{" "}
            คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทําข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทํางานได้
            โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ
            รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทําได้ด้วยวิธีการอัตโนมัติ
            และมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือ
            โอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง
            เว้นแต่ไม่สามารถดําเนินการได้เพราะเหตุทางเทคนิค
          </li>
          <li>
            <b>สิทธิขอคัดค้าน (Right to object):</b> คุณมีสิทธิขอคัดค้านการเก็บรวบรวม ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทําขึ้นเพื่อการดําเนินงานที่จําเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น
            โดยไม่เกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดําเนินการตามภารกิจเพื่อสาธารณประโยชน์
          </li>
          <li>
            <b>สิทธิขอให้ลบหรือทําลายข้อมูล (Right to erasure/destruction):</b>{" "}
            คุณมีสิทธิขอลบหรือทําลายข้อมูลส่วนบุคคลของคุณหรือทําให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้
            หากคุณเชื่อว่าข้อมูลส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้
            หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้องหรือเห็นว่าเราหมดความจําเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือใช้สิทธิขอคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว
          </li>
          <li>
            <b>สิทธิขอให้ระงับการใช้ข้อมูล (Right to restriction of processing):</b>{" "}
            คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคําร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณหรือ
            กรณีอื่นใดที่เราหมดความจําเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน
          </li>
          <li>
            <b>สิทธิขอให้แก้ไขข้อมูล (Right to rectification):</b>{" "}
            คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์
            และไม่ก่อให้เกิดความเข้าใจผิด
          </li>
          <li>
            <b>สิทธิร้องเรียน (Right to lodge a complaint):</b>{" "}
            คุณมีสิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง หากคุณเชื่อว่าการเก็บรวบรวม ใช้
            หรือเปิดเผยข้อมูลส่วนบุคคลของคุณเป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง
          </li>
        </ul>
        <p className="text-body-1">
          คุณสามารถใช้สิทธิของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลข้างต้นได้
          โดยติดต่อมาที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดท้ายนโยบายนี้
          เราจะแจ้งผลการดำเนินการภายในระยะเวลา 30 วัน นับแต่วันที่เราได้รับคำขอใช้สิทธิจากคุณ
          ตามแบบฟอร์มหรือวิธีการที่เรากำหนด ทั้งนี้
          หากเราปฏิเสธคำขอเราจะแจ้งเหตุผลของการปฏิเสธให้คุณทราบผ่านช่องทางต่าง ๆ เช่น อีเมล โทรศัพท์ เป็นต้น
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">10. คุกกี้ที่เราใช้งาน</h1>
        <ul className="text-body-1 list-disc pl-6">
          <li>
            คุกกี้ที่มีความจำเป็นอย่างยิ่ง (Necessary Cookies)
            คุกกี้ประเภทนี้มีบทบาทสำคัญในการมอบประสบการณ์การใช้งานที่ดีที่สุดเมื่อคุณเข้าถึงและสำรวจเว็บไซต์
            ของเรา รวมถึงการใช้งานคุณสมบัติต่างๆ ตัวอย่างเช่น
            คุกกี้เหล่านี้ช่วยแจ้งให้เราทราบว่าคุณได้สร้างบัญชีและลงชื่อเข้าใช้เพื่อเข้าถึงเนื้อหา
          </li>
        </ul>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">11. การรักษาความมั่นคงและความปลอดภัยของข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          เราจะปกป้องข้อมูลส่วนบุคคลของคุณโดยยึดหลักการรักษาความลับ (confidentiality)
          ความถูกต้องและครบถ้วนของข้อมูล (integrity) และความพร้อมในการใช้งาน (availability)
          เพื่อป้องกันการสูญหาย การเข้าถึงโดยไม่ได้รับอนุญาต การใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผยข้อมูล
          นอกจากนี้ เราได้กำหนดมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
          ซึ่งครอบคลุมมาตรการป้องกันด้านการบริหารจัดการ (administrative safeguard) ด้านเทคนิค (technical
          safeguard) และด้านกายภาพ (physical safeguard) รวมถึงการควบคุมการเข้าถึงและการใช้งานข้อมูลส่วนบุคคล
          (access control)
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">12. การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล</h1>
        <p className="text-body-1">
          ในกรณีที่มีเหตุละเมิดข้อมูลส่วนบุคคลของคุณเกิดขึ้น
          เราจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบโดยไม่ช้าภายใน 72 ชั่วโมง
          นับแต่ทราบเหตุเท่าที่สามารถกระทำได้
          ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของคุณ
          เราจะแจ้งการละเมิดให้คุณทราบพร้อมกับแนวทางการเยียวยาโดยไม่ชักช้าผ่านช่องทางต่าง ๆ เช่น เว็บไซต์
          อีเมล โทรศัพท์ เป็นต้น
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">13. รายละเอียดการติดต่อ</h1>
        <p className="text-body-1">
          หากท่านมีข้อสงสัย หรือต้องการสอบถามเกี่ยวกับ นโยบายและการคุ้มครองข้อมูลส่วนบุคคลของโครงการ
          หรือประสงค์จะสอบถามเกี่ยวกับการใช้สิทธิของ เจ้าของข้อมูลในการดำเนินการอย่างหนึ่งอย่างใดกับ
          ข้อมูลส่วนบุคคลของท่านซึ่งโครงการ ได้เก็บรวบรวมใช้
          ท่านสามารถติดต่อได้ที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล สถานที่ติดต่อ อีเมล
        </p>
      </div>
      <div className="flex flex-col gap-6">
        <h1 className="text-header-2-medium">หัวหน้าฝ่ายทะเบียน</h1>
        <h1 className="text-body-2">นายธน อุดมพรกุล</h1>
        <div className="flex">
          <div className="flex min-w-0 flex-1 flex-col gap-4">
            <div className="flex items-center gap-4">
              <IconCircle className="h-[50px] w-[50px] flex-shrink-0 2xl:h-[60px] 2xl:w-[60px]">
                <img
                  src="/static/icon/Phone.svg"
                  alt="Staff Icon"
                  className="h-[30px] w-[30px] 2xl:h-9 2xl:w-9"
                />
              </IconCircle>
              <div className="text-body-1 text-[18px] text-[var(--color-gray-50)] lg:text-[20px] 2xl:text-[24px]">
                หมายเลขโทรศัพท์
              </div>
            </div>
            <div className="text-body-1 whitespace-normal break-words text-[18px] lg:text-[20px] 2xl:text-[24px]">
              082 113 9665
            </div>
          </div>
          <div className="flex min-w-0 flex-1 flex-col gap-4">
            <div className="flex items-center gap-4">
              <IconCircle className="h-[50px] w-[50px] flex-shrink-0 2xl:h-[60px] 2xl:w-[60px]">
                <img
                  src="/static/icon/Mail.svg"
                  alt="Staff Icon"
                  className="h-[30px] w-[30px] 2xl:h-9 2xl:w-9"
                />
              </IconCircle>
              <div className="text-body-1 text-[18px] text-[var(--color-gray-50)] lg:text-[20px] 2xl:text-[24px]">
                อีเมล
              </div>
            </div>
            <div className="text-body-1 whitespace-normal break-words text-[18px] lg:text-[20px] 2xl:text-[24px]">
              tana.udom@mail.kmutt.ac.th
            </div>
          </div>
        </div>
      </div>
      <div className="flex w-full pt-12">
        <Link href="/">
          <IconCircle className="pr-6">
            <img src="/static/icon/Left_arrow.svg" alt="Left Arrow Icon" />
            <p className="text-body-1">ย้อนกลับ</p>
          </IconCircle>
        </Link>
      </div>
    </div>
  )
}
export default PrivacyPolicyPage
