"use client"

import ScrollArea from "@/app/_components/scope/ScrollArea"
import { Button } from "@workspace/ui/components/button"
import { cn } from "@workspace/ui/lib/utils"
import { useEffect, useState } from "react"

export default function PolicyConsent({ demo = false }) {
  const [isOpen, setIsOpen] = useState(false)
  const [hide, setHide] = useState(false)

  const COOKIE_NAME = "confirm.consent"

  const accept = () => {
    setIsOpen(false)
    document.cookie = `${COOKIE_NAME}=true; expires=Fri, 31 Dec 9999 23:59:59 GMT`
    setTimeout(() => {
      setHide(true)
    }, 700)
  }

  useEffect(() => {
    try {
      setIsOpen(true)
      if (document.cookie.includes(`${COOKIE_NAME}=true`)) {
        if (!demo) {
          setIsOpen(false)
          setTimeout(() => {
            setHide(true)
          }, 700)
        }
      }
    } catch {
      //ignore error
    }
    // eslint-disable-next-line react-hooks/exhaustive-deps
  }, [])

  return (
    <div
      className={cn(
        "font-prompt fixed left-0 right-0 top-0 z-[200] flex h-full items-center justify-center duration-700",
        !isOpen
          ? "translate-y-8 opacity-0 transition-[opacity,transform]"
          : "translate-y-0 opacity-100 transition-[opacity,transform]",
        hide && "hidden"
      )}>
      <div className="liquid flex h-fit max-h-[80vh] w-full max-w-[80rem] justify-between rounded-[3rem]">
        <div className="grid h-fit w-full grid-rows-[auto_1fr_auto] gap-8 p-10 text-white">
          <div className="flex h-full items-center gap-6">
            <div className="liquid flex size-[3rem] min-h-[3rem] min-w-[3rem] items-center justify-center rounded-[1.25rem] lg:size-[3.75rem]">
              d
            </div>
            <p className="text-header-2-medium">นโยบายความเป็นส่วนตัว (Privacy Policy)</p>
          </div>
          <ScrollArea className="max-h-[30rem] rounded-xl" colorTheme="#9F83DC">
            ดีกรีโฮลวีตโอเวอร์ก๊วน กราวนด์แคร์ มลภาวะอิเหนา แดรี่สตาร์ต่อยอด บาลานซ์ ซาร์ดีน แบดก๋ากั่น
            เกย์แจ๊กพอตหน่อมแน้มคอมเพล็กซ์ไกด์ กับดักแอร์ วิภัชภาคโยเกิร์ตเซี้ยวแคมป์โรแมนติก รีวิวหยวน
            โปรเจคท์มั้ง แรลลี่วัจนะคอร์รัปชั่นเนอะ โอเปอเรเตอร์ฟาสต์ฟู้ด กลาสเซรามิกแพนดาโดมิโน เซาท์วีเจบิ๊ก
            อึมครึมฟลอร์ โหลยโท่ยซะเฮีย เชฟเทรลเลอร์เทวาธิราชซิลเวอร์ไนท์ ตัวเอง แชเชือนจตุคามแรงดูดแอ็กชั่น
            ธรรมาภิบาลพาร์ตเนอร์สต็อก อันตรกิริยา อมาตยาธิปไตย ซีเนียร์แพนงเชิญ อึมครึมไทเฮาไลท์ สุนทรีย์โค้ช
            เฮอร์ริเคนโชห่วยดีเจซะเทียมทาน ว้าวเซฟตี้ตู้เซฟ โซลาร์ออร์เดอร์เฟอร์รี่เยอร์บีราแอคทีฟ
            ดีพาร์ทเมนท์ว้าวขั้นตอนเซี้ยวสปิริต จ๊อกกี้ฮิโซนพาสต้าเมจิก ชินบัญชรมอบตัวพรีเซ็นเตอร์วิกต่อยอด
            ฟลุท แพนดา ฮัลโหลแอ็กชั่นคอร์ปแชมปิยองวีน จิตเภท อีสต์บ๊อบฟรังก์สตูดิโอ
            ภควัมปติเวิร์กแคชเชียร์สเปก ช็อปปิ้งกุมภาพันธ์ออสซี่ดีพาร์ทเมนท์น็อค ยังไงแม็กกาซีน
            คองเกรสโนติสไนน์ แครกเกอร์เอาต์เยอร์บีร่า ซาตาน ตรวจสอบบอมบ์เฮียสมาพันธ์ จ๊าบเพียวภควัมบดีเพาเวอร์
            แชเชือนเห็นด้วยแดรี่โบกี้ นู้ด บัลลาสต์ศิลปากรตัวเองคอนเฟิร์มแมมโบ้ แพนด้าซูโม่แกสโซฮอล์
            โค้ชเท็กซ์ซาบะ ดราม่าแบ็กโฮโคโยตี ขั้นตอนเบิร์ดแซลมอนตรวจสอบ พรีเซ็นเตอร์เฟิร์มพรีเมียร์
            โดมิโนคำตอบยอมรับ เป่ายิ้งฉุบ ราเม็งซิมโฟนี่แบตบ๊วยปิยมิตร ฮาร์ด กรุ๊ป
            ครูเสดสปิริตแพนดาสกายคอนเฟิร์ม สตูดิโอแอร์สตรอเบอรีเรตฉลุย เวสต์แหววแฮนด์เยนคอนโดมิเนียม คาสิโน
            เซ็กซ์บูมฮาลาล แพนดาโฮปนู้ดบูม บ๊อบโนติสบูติกนาฏยศาลาโปรเจ็ค ซูโม่ ทอมฮ่องเต้ พรีเซ็นเตอร์
            ตุ๊กตุ๊กทอม เห่ยฮัลโหลคอปเตอร์รูบิคเครป รวมมิตรซิตี้ก๊วนยนตรกรรมฮาลาล ตื้บแมคเคอเรลแชมเปี้ยน
            แชเชือนซานตาคลอส ชัตเตอร์โทร แพนดา ซิมโฟนี เพียวคอร์ป กู๋โอยัวะเนอะ เสกสรรค์อมาตยาธิปไตย
            ดีกรีโฮลวีตโอเวอร์ก๊วน กราวนด์แคร์ มลภาวะอิเหนา แดรี่สตาร์ต่อยอด บาลานซ์ ซาร์ดีน แบดก๋ากั่น
            เกย์แจ๊กพอตหน่อมแน้มคอมเพล็กซ์ไกด์ กับดักแอร์ วิภัชภาคโยเกิร์ตเซี้ยวแคมป์โรแมนติก รีวิวหยวน
            โปรเจคท์มั้ง แรลลี่วัจนะคอร์รัปชั่นเนอะ โอเปอเรเตอร์ฟาสต์ฟู้ด กลาสเซรามิกแพนดาโดมิโน เซาท์วีเจบิ๊ก
            อึมครึมฟลอร์ โหลยโท่ยซะเฮีย เชฟเทรลเลอร์เทวาธิราชซิลเวอร์ไนท์ ตัวเอง แชเชือนจตุคามแรงดูดแอ็กชั่น
            ธรรมาภิบาลพาร์ตเนอร์สต็อก อันตรกิริยา อมาตยาธิปไตย ซีเนียร์แพนงเชิญ อึมครึมไทเฮาไลท์ สุนทรีย์โค้ช
            เฮอร์ริเคนโชห่วยดีเจซะเทียมทาน ว้าวเซฟตี้ตู้เซฟ โซลาร์ออร์เดอร์เฟอร์รี่เยอร์บีราแอคทีฟ
            ดีพาร์ทเมนท์ว้าวขั้นตอนเซี้ยวสปิริต จ๊อกกี้ฮิโซนพาสต้าเมจิก ชินบัญชรมอบตัวพรีเซ็นเตอร์วิกต่อยอด
            ฟลุท แพนดา ฮัลโหลแอ็กชั่นคอร์ปแชมปิยองวีน จิตเภท อีสต์บ๊อบฟรังก์สตูดิโอ
            ภควัมปติเวิร์กแคชเชียร์สเปก ช็อปปิ้งกุมภาพันธ์ออสซี่ดีพาร์ทเมนท์น็อค ยังไงแม็กกาซีน
            คองเกรสโนติสไนน์ แครกเกอร์เอาต์เยอร์บีร่า ซาตาน ตรวจสอบบอมบ์เฮียสมาพันธ์ จ๊าบเพียวภควัมบดีเพาเวอร์
            แชเชือนเห็นด้วยแดรี่โบกี้ นู้ด บัลลาสต์ศิลปากรตัวเองคอนเฟิร์มแมมโบ้ แพนด้าซูโม่แกสโซฮอล์
            โค้ชเท็กซ์ซาบะ ดราม่าแบ็กโฮโคโยตี ขั้นตอนเบิร์ดแซลมอนตรวจสอบ พรีเซ็นเตอร์เฟิร์มพรีเมียร์
            โดมิโนคำตอบยอมรับ เป่ายิ้งฉุบ ราเม็งซิมโฟนี่แบตบ๊วยปิยมิตร ฮาร์ด กรุ๊ป
            ครูเสดสปิริตแพนดาสกายคอนเฟิร์ม สตูดิโอแอร์สตรอเบอรีเรตฉลุย เวสต์แหววแฮนด์เยนคอนโดมิเนียม คาสิโน
            เซ็กซ์บูมฮาลาล แพนดาโฮปนู้ดบูม บ๊อบโนติสบูติกนาฏยศาลาโปรเจ็ค ซูโม่ ทอมฮ่องเต้ พรีเซ็นเตอร์
            ตุ๊กตุ๊กทอม เห่ยฮัลโหลคอปเตอร์รูบิคเครป รวมมิตรซิตี้ก๊วนยนตรกรรมฮาลาล ตื้บแมคเคอเรลแชมเปี้ยน
            แชเชือนซานตาคลอส ชัตเตอร์โทร แพนดา ซิมโฟนี เพียวคอร์ป กู๋โอยัวะเนอะ เสกสรรค์อมาตยาธิปไตย
            ดีกรีโฮลวีตโอเวอร์ก๊วน กราวนด์แคร์ มลภาวะอิเหนา แดรี่สตาร์ต่อยอด บาลานซ์ ซาร์ดีน แบดก๋ากั่น
            เกย์แจ๊กพอตหน่อมแน้มคอมเพล็กซ์ไกด์ กับดักแอร์ วิภัชภาคโยเกิร์ตเซี้ยวแคมป์โรแมนติก รีวิวหยวน
            โปรเจคท์มั้ง แรลลี่วัจนะคอร์รัปชั่นเนอะ โอเปอเรเตอร์ฟาสต์ฟู้ด กลาสเซรามิกแพนดาโดมิโน เซาท์วีเจบิ๊ก
            อึมครึมฟลอร์ โหลยโท่ยซะเฮีย เชฟเทรลเลอร์เทวาธิราชซิลเวอร์ไนท์ ตัวเอง แชเชือนจตุคามแรงดูดแอ็กชั่น
            ธรรมาภิบาลพาร์ตเนอร์สต็อก อันตรกิริยา อมาตยาธิปไตย ซีเนียร์แพนงเชิญ อึมครึมไทเฮาไลท์ สุนทรีย์โค้ช
            เฮอร์ริเคนโชห่วยดีเจซะเทียมทาน ว้าวเซฟตี้ตู้เซฟ โซลาร์ออร์เดอร์เฟอร์รี่เยอร์บีราแอคทีฟ
            ดีพาร์ทเมนท์ว้าวขั้นตอนเซี้ยวสปิริต จ๊อกกี้ฮิโซนพาสต้าเมจิก ชินบัญชรมอบตัวพรีเซ็นเตอร์วิกต่อยอด
            ฟลุท แพนดา ฮัลโหลแอ็กชั่นคอร์ปแชมปิยองวีน จิตเภท อีสต์บ๊อบฟรังก์สตูดิโอ
            ภควัมปติเวิร์กแคชเชียร์สเปก ช็อปปิ้งกุมภาพันธ์ออสซี่ดีพาร์ทเมนท์น็อค ยังไงแม็กกาซีน
            คองเกรสโนติสไนน์ แครกเกอร์เอาต์เยอร์บีร่า ซาตาน ตรวจสอบบอมบ์เฮียสมาพันธ์ จ๊าบเพียวภควัมบดีเพาเวอร์
            แชเชือนเห็นด้วยแดรี่โบกี้ นู้ด บัลลาสต์ศิลปากรตัวเองคอนเฟิร์มแมมโบ้ แพนด้าซูโม่แกสโซฮอล์
            โค้ชเท็กซ์ซาบะ ดราม่าแบ็กโฮโคโยตี ขั้นตอนเบิร์ดแซลมอนตรวจสอบ พรีเซ็นเตอร์เฟิร์มพรีเมียร์
            โดมิโนคำตอบยอมรับ เป่ายิ้งฉุบ ราเม็งซิมโฟนี่แบตบ๊วยปิยมิตร ฮาร์ด กรุ๊ป
            ครูเสดสปิริตแพนดาสกายคอนเฟิร์ม สตูดิโอแอร์สตรอเบอรีเรตฉลุย เวสต์แหววแฮนด์เยนคอนโดมิเนียม คาสิโน
            เซ็กซ์บูมฮาลาล แพนดาโฮปนู้ดบูม บ๊อบโนติสบูติกนาฏยศาลาโปรเจ็ค ซูโม่ ทอมฮ่องเต้ พรีเซ็นเตอร์
            ตุ๊กตุ๊กทอม เห่ยฮัลโหลคอปเตอร์รูบิคเครป รวมมิตรซิตี้ก๊วนยนตรกรรมฮาลาล ตื้บแมคเคอเรลแชมเปี้ยน
            แชเชือนซานตาคลอส ชัตเตอร์โทร แพนดา ซิมโฟนี เพียวคอร์ป กู๋โอยัวะเนอะ เสกสรรค์อมาตยาธิปไตย
          </ScrollArea>
          <div className="flex h-full w-full justify-between">
            <Button onClick={accept} className="h-full w-full">
              ยอมรับ
            </Button>
          </div>
        </div>
      </div>
    </div>
  )
}
