export const siteConfig = {
  name: "Bangmod Hackathon 2025 ได้เปิดรับสมัครเป็นที่เรียบร้อยแล้ว",
  url: "https://bangmodhackathon.com",
  ogImage: "https://bangmodhackathon.com/static/og.png",
  description:
    "การแข่งขันเขียนโปรแกรมภาษา C/C++ สำหรับนักเรียนมัธยมปลายและนักศึกษาอาชีวะ (ปวช. หรือเทียบเท่า) ในรูปแบบทีม เสริมทักษะการเขียนโค้ด ฝึกทำงานร่วมกัน และเก็บประสบการณ์จริงจากสนามแข่งขัน พร้อมเชิญชวนน้อง ๆ เข้าร่วมสมัครและโชว์ฝีมือกัน 💻✨",
  links: {
    facebook: "https://www.facebook.com/BangmodHackathon",
    instagram: "https://www.instagram.com/bangmodhack.kmutt",
  },
}
