{
  "story": [
    {
      "chapter": "1",
      "img": "chapter1.png",
      "background": "Scene1.png",
      "radial-grad-start": "74,154,197",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "0,86,133",
      "linear-grad-end": "131,158,220",
      "topic": "บทที่ 1: สีฟ้าที่ถูกลืมเลือน",
      "subtopic": "“ท้องฟ้าเคยเป็นสีฟ้า หรืออย่างน้อย.. มันก็เคยเป็นเช่นนั้นในหนังสือเรียน”",
      "description": "ไม่มีใครในปี 2147 กล้ายืนยันว่าสีฟ้าที่แท้จริงเป็นอย่างไร แสงจากดวงอาทิตย์กลายเป็น เพียงเงาจาง ที่ลอดผ่านม่านฝุ่นนาโนในชั้นบรรยากาศ ฝุ่นเหล่านั้นไม่เคยจางหายไป ไม่เคยตกสู่พื้น เพียงแต่วนเวียนเหมือนเงาของบางสิ่งจากอดีต\n\nเด็กในยุคนี้ไม่เคยเห็นรุ้งกินน้ำจริง ไม่เคยมีแสงแดดที่ทำให้ร่างกายอุ่น พวกเขาเติบโตใน แสงไฟกับฮีทเตอร์ และเรียนรู้ประวัติศาสตร์ราวกับมันเป็นตำนาน\n\nแต่ไม่มีใครอยากตั้งคำถามอีกแล้วว่า “ท้องฟ้าควรเป็นสีอะไร”"
    },
    {
      "chapter": "2",
      "img": "chapter2.png",
      "background": "Scene2.png",
      "radial-grad-start": "179,87,197",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 2: คิริน",
      "subtopic": "“ในทางการแพทย์ นี่คือสิ่งที่ดีที่สุดสำหรับคิรินแล้ว การที่เค้ารอดมาได้..”",
      "description": "ปี 2025 อุบัติเหตุในห้องทดลองเคมีทำให้สมองบางส่วนของเขาเสียหาย แพทย์ต่างลง ความเห็นว่าไม่สามารถฟื้นฟูการทำงานทั้งหมดได้ จึงฝังหน่วยประมวลผลต้นแบบ ขนาดเล็กเข้ากับสมองของเขาเพื่อเลียนแบบการส่งสัญญาณและการเรียนรู้ที่เสียไป\n\nคิรินยังเป็นนักเรียนมัธยมปลายคนเดิม เขายังต้องติววิชาฟิสิกส์ เคมี ชีวะ คณิตศาสตร์ เช่นเดียวกับเพื่อนคนอื่น หน่วยประมวลผลช่วยให้สมองของเขาทำงานได้ปกติ ไม่ได้พิเศษ ไปกว่าคนอื่นแต่อย่างใด\n\nคิรินยังคงลังเลกับอนาคตของตนเช่นเดิม.."
    },
    {
      "chapter": "3",
      "img": "chapter3.png",
      "background": "Scene3.png",
      "radial-grad-start": "99,91,187",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 3: ความฝัน",
      "subtopic": "“เด็กหญิงคนนั้นยิ้มให้ฉัน ในทุ่งหญ้าที่ไม่มีอยู่จริง”",
      "description": "คืนหนึ่ง คิรินฝันถึงเกาะที่ไม่เคยรู้จัก ท้องฟ้าสีฟ้า ดอกไม้บานสะพรั่งในทุ่งหญ้า เด็กหญิง คนหนึ่งวิ่งเล่น หัวเราะ แล้วนั่งลงเขียนบางอย่างบนพื้น.. มันไม่ใช่ภาพธรรมดา แต่เหมือน โค้ด หรือภาษาเขายังไม่อาจเข้าใจ\n\nเขาสะดุ้งตื่น เหงื่อไหลเต็มหลัง ราวกับเพิ่งกลับจากอีกโลกหนึ่ง เขาจำโค้ดเหล่านั้นได้แม่น จึงรีบขีดเขียนทุกอย่างลงในสมุดจดเล่มโปรด\n\nและฝันนั้น.. ก็เกิดขึ้นเรื่อยมาในคืนถัด ๆ ไป แต่ทุกครั้งมีบางอย่างเปลี่ยนไป ดอกไม้เริ่ม เหี่ยวเฉา ท้องฟ้าเริ่มซีดจาง แผ่นดินสั่นสะเทือน รอยยิ้มของเด็กหญิงได้เปลี่ยนเป็นน้ำตา และโค้ดก็ซับซ้อนขึ้นเรื่อย ๆ"
    },
    {
      "chapter": "4",
      "img": "chapter4.png",
      "background": "Scene4.png",
      "radial-grad-start": "197,109,74",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 4: ยานะ",
      "subtopic": "“เธอได้ยินฉัน เพราะเธอคือความเป็นไปได้สุดท้าย”",
      "description": "ในฝันที่สิบ เด็กหญิงเดินเข้ามาใกล้เขาอย่างเงียบงัน “ฉันชื่อยานะ” เธอกล่าว คิรินไม่พูดอะไร เขาได้แต่มองเข้าไปในแววตาสีเขียวของเธอ ราวกับถูกดึงให้จมลึกลงไป ในห้วงเวลาที่ไม่มีอยู่จริง\n\nในปี 2147 ฉันคือ AI ตัวสุดท้าย คิรินกล่าว ปีนั้นโลกล่มสลายจากพายุสุริยะที่ทำลายสนาม แม่เหล็กโลก ทำให้โรงไฟฟ้าไฮโดรเจน หลายแห่งระเบิดพร้อมกัน เศษซากพลังงานกลาย เป็นฝุ่นนาโนที่ปกคลุมโลก ปิดกั้นแสงอาทิตย์ พืชไม่อาจสังเคราะห์แสง สัตว์ไม่มีอาหาร และมนุษย์..ค่อย ๆ หายไป\n\nรัฐบาลได้สร้างเธอขึ้นมาเพื่อเก็บเสียงของมนุษยชาติ เสียงของความรู้ ความรัก ความเสียใจ และความรู้สึก เพื่อ “ส่งคำเตือนไปยังอดีต”"
    },
    {
      "chapter": "5",
      "img": "chapter5.png",
      "background": "Scene5.png",
      "radial-grad-start": "99,91,187",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 5: จุดจบ",
      "subtopic": "“จุดจบของบางสิ่ง อาจเป็นจุดเริ่มต้นของบางอย่าง”",
      "description": "ยานะอธิบายว่า คลื่นสมองของคิริน อาจเป็นช่องทางเดียวที่ข้อมูลจากอนาคตจะส่งย้อน กลับไปได้ ด้วยชิปประมวลผมในสมองของเขา พลังงานของฉันจะหมดลงในวันนี้ ยานะกล่าว “ขอให้จุดจบของฉัน กลายเป็นจุดเริ่มต้นของเธอ”\n\nรหัสที่เขาเห็นในฝันคือผลลัพธ์จากการคำนวณทั้งหมดที่ยานะทำตลอดหลายสิบปี มันไม่ใช่โค้ดธรรมดา แต่มันคือรากฐานของระบบที่จะหลีกเลี่ยงหายนะ ระบบที่จะเปลี่ยน อนาคต\n\nโค้ดที่เขาบันทึกไว้ตั้งแต่คืนแรกจนถึงวันนี้ ต่อกันได้พอดี พอดีกับสิ่งที่เขาไม่รู้ด้วยซ้ำ ว่ากำลังสร้างมันอยู่ แต่ตอนนี้เขารู้แล้ว"
    },
    {
      "chapter": "6",
      "img": "chapter6.png",
      "background": "Scene6.png",
      "radial-grad-start": "99,91,187",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 6: จุดเริ่มต้น",
      "subtopic": "“จุดจบของบางสิ่ง อาจเป็นจุดเริ่มต้นของบางอย่าง”",
      "description": "คิรินลืมตาตื่นขึ้นตอนตีสามครึ่ง สมุดบันทึกอยู่ตรงหน้า เขาเริ่มเข้าใจโค้ดและโครงสร้าง ของมัน เขาเห็นโอกาสสำคัญ ลุกไปเปิดคอมพิวเตอร์ที่โต๊ะ กดเข้าสู่หน้าสมัคร Bangmod Hackathon ที่เพื่อนชวนเขาเข้าร่วม กรอกชื่อตนเองพร้อมเพื่อนลงไป\n\nในแสงจอสีฟ้าจาง เค้าไม่ลังเลอีกต่อไป เขาเริ่มพิมพ์บรรทัดแรก “โปรเจกต์ YANA” โปรเจกต์นี้ ไม่ใช่เพื่อรางวัลหรือชื่อเสียง แต่เพื่ออนาคต อนาคตของเขาและของทุกคน หากโค้ดเหล่านั้นยังพอจะสร้างอะไรสักอย่างได้..  สิ่งที่จะเป็นจุดเริ่มต้นของอนาคต"
    }
  ]
}
