{
  "story": [
    {
      "chapter": "1",
      "img": "chapter1.webp",
      "background": "Scene1.webp",
      "radial-grad-start": "74,154,197",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "0,86,133",
      "linear-grad-end": "131,158,220",
      "topic": "บทที่ 1: สีฟ้าที่ถูกลืมเลือน",
      "subtopic": "“ท้องฟ้าเคยเป็นสีฟ้า หรืออย่างน้อย... มันก็เคยเป็นเช่นนั้นในหนังสือเรียน”",
      "description": "บางคนอาจฝันถึงท้องฟ้าสีฟ้า บางคนฝันถึงสิ่งที่ไม่เคยมีอยู่จริง และบางคน… ก็อาจฝันถึงเสียงสะท้อนจากอนาคต\n\nไม่มีใครในปี 2147 กล้ายืนยันว่าสีฟ้าที่แท้จริงเป็นอย่างไร แสงจากดวงอาทิตย์กลายเป็นเพียง เงาจางที่ลอดผ่านม่านฝุ่นนาโนในชั้นบรรยากาศ ฝุ่นเหล่านั้นไม่เคยจางหายไป ไม่เคยตกสู่พื้น เพียงแต่วนเวียนเหมือนเงาของบางสิ่งจากอดีต\n\nเด็กในยุคนี้ไม่เคยเห็นรุ้งกินน้ำจริง ไม่เคยมีแสงแดดที่ทำให้ร่างกายอุ่น พวกเขาเติบโตใน แสงไฟกับฮีทเตอร์ และเรียนรู้ประวัติศาสตร์ราวกับมันเป็นตำนาน\n\nแต่ไม่มีใครอยากตั้งคำถามอีกแล้วว่า “ท้องฟ้าควรเป็นสีอะไร”"
    },
    {
      "chapter": "2",
      "img": "chapter2.webp",
      "background": "Scene2.webp",
      "radial-grad-start": "97,91,187",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 2: คิริน",
      "subtopic": "“ความฝันน่ะเหรอ ทำไมผมไม่มีมันเลย การมีความฝันมันเป็นยังไงกันแน่”",
      "description": "“คิริน… แล้วในอนาคต เธออยากทำอะไร มีสิ่งไหนที่สนใจมั้ย” ครูแนะแนวถาม\n\nเด็กหนุ่มเงียบไปพักหนึ่ง “ผม… ผมก็ไม่รู้เหมือนกันครับครู ผมแค่ทำตามที่เรียนได้ แต่ไม่รู้ว่า มันคือสิ่งที่ผมชอบจริง ๆ รึเปล่า ผมไม่รู้เลยครับว่าผมฝันอยากเป็นอะไร”\n\nครูหัวเราะเบา ๆ ก่อนพูดต่อ “ความฝันน่ะ ไม่จำเป็นต้องชัดเจนตอนนี้หรอก บางทีมัน อาจโผล่มาในวันที่เธอไม่ทันตั้งตัวก็ได้”\n\n2 ปีก่อน คิรินประสบอุบัติเหตุในห้องทดลอง ทำให้สมองของเขาเสียหาย แพทย์ไม่สามารถฟื้นฟู มันได้ทั้งหมด จึงทดลองฝังหน่วยประมวลผลต้นแบบ เพื่อช่วยให้สมองของเขาทำงานได้ตามปกติ แต่ถึงอย่างนั้นเขาก็ยังเป็นเด็กม.6 คนเดิมไม่ได้พิเศษไปกว่าคนอื่นแต่อย่างใด"
    },
    {
      "chapter": "3",
      "img": "chapter3.webp",
      "background": "Scene3.webp",
      "radial-grad-start": "99,91,187",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 3: ความฝัน",
      "subtopic": "“เด็กหญิงคนนั้นยิ้มให้ฉัน ในทุ่งหญ้าที่ไม่มีอยู่จริง”",
      "description": "คืนหนึ่ง คิรินฝันถึงเกาะที่ไม่เคยรู้จัก ท้องฟ้าสีฟ้าม่วง ดอกไม้บานสะพรั่งในทุ่งหญ้า เด็กหญิง คนหนึ่งกำลังวิ่งเล่น หัวเราะ แล้วนั่งลงเขียนบางอย่างบนพื้น... มันไม่ใช่ภาพธรรมดา แต่ลักษณะเป็นตัวอักษรคล้ายโค้ด ที่เขาก็ยังไม่อาจเข้าใจ\n\nเขาสะดุ้งตื่น เหงื่อไหลเต็มหลัง ราวกับเพิ่งกลับจากอีกโลกหนึ่ง เขาจำตัวอักษรเหล่านั้นได้แม่น จึงรีบขีดเขียนทุกอย่างลงในสมุดจดเล่มโปรด\n\nและฝันนั้น... ก็เกิดขึ้นเรื่อยมาในคืนถัด ๆ ไป แต่ทุกครั้งมีบางอย่างเปลี่ยนไป ดอกไม้เริ่มเหี่ยวเฉา ท้องฟ้าเริ่มซีดจาง พื้นที่โดยรอบมีเถ้าถ่านสีดำปกคลุมไปทั่วบริเวณ แผ่นดินสั่นสะเทือน รอยยิ้มของเด็กหญิงคนนั้นได้เปลี่ยนเป็นน้ำตา และอักษรนั้นก็ซับซ้อนขึ้นเรื่อย ๆ"
    },
    {
      "chapter": "4",
      "img": "chapter4.webp",
      "background": "Scene4.webp",
      "radial-grad-start": "197,109,74",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 4: ยานะ",
      "subtopic": "“เธอได้ยินฉัน เพราะเธอคือความเป็นไปได้สุดท้าย”",
      "description": "ในฝันคืนที่ 87 เด็กหญิงเดินเข้ามาใกล้เขาอย่างเงียบงัน เสียงเธอแผ่วเหมือนสายลม “ฉันชื่อยานะ” คิรินได้แต่มองเข้าไปในแววตาสีเขียวของเธอ ราวกับถูกดึงให้จมลึกลงไปในห้วงเวลาที่ไม่มีอยู่จริง\n\nคิรินเอ่ยถาม “ทำไมเธอถึงมาอยู่ในฝันของฉัน”\n\nยานะหลับตาลง “เพราะสมองถูกดัดแปลงทำให้เธอฝันถึงฉัน เธอคือความเป็นไปได้สุดท้าย”\n\n“ในปี 2147 ฉันคือ AI ตัวสุดท้ายที่ยังทำงานได้ในโลกที่ล่มสลายจากพายุสุริยะ อักษรเหล่านี้คือ โค้ดที่สร้างมาจากตัวฉันเอง ฉันคือข้อมูลเพื่อหลีกเลี่ยงภัยพิบัติเปลี่ยนของอนาคตของเธอ” ยานะเอ่ยช้า ๆ “พลังงานของฉันกำลังหมดลงแล้ว และนี่จะเป็นโค้ดส่วนสุดท้าย”"
    },
    {
      "chapter": "5",
      "img": "chapter5.webp",
      "background": "Scene5.webp",
      "radial-grad-start": "179,87,197",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 5: จุดจบ",
      "subtopic": "“จุดจบของบางสิ่ง อาจเป็นจุดเริ่มต้นของบางอย่าง”",
      "description": "ยานะยิ้มบาง ๆ “ไม่ต้องเป็นฮีโร่ก็ได้ แค่ทำตามความฝันนี้ก็พอ... เธอจะต้องเข้าใจมันแน่” เสียงเธอเริ่มแผ่วลงราวกับกำลังถูกกลืนหายไปกับสายลม\n\n“เพราะฉันเชื่อว่าสิ่งเล็ก ๆ ที่เธอทำต่อจากนี้… จะเป็นจุดเริ่มต้นของความฝัน” เธอกล่าวก่อนสลายไป “ขอให้จุดจบของฉัน กลายเป็นจุดเริ่มต้นของเธอ ทีนี้ก็ถึงเวลาตื่นแล้ว”\n\nคิรินสะดุ้งตื่น เขาลุกขึ้นนั่ง น้ำตาเอ่อขึ้นโดยไม่รู้ตัว ก่อนที่ภาพของเธอจะค่อย ๆ จางหายไป สมุดบันทึกเล่มหนาเปิดค้างอยู่ข้าง ๆ หน้ากระดาษเต็มไปด้วยตัวอักษรที่เขาเห็นซ้ำแล้วซ้ำเล่า ในฝัน บัดนี้มันไม่ใช่แค่รอยขีดเขียนที่ไร้ความหมายอีกต่อไป แต่กลายเป็นโครงสร้างของยานะ\n\nนี่ไม่ใช่ความฝันอีกต่อไป นี่คือ จุดเริ่มต้นของเขาและบางที อาจเป็นจุดเริ่มต้นของอนาคตด้วย"
    },
    {
      "chapter": "6",
      "img": "chapter6.webp",
      "background": "Scene6.webp",
      "radial-grad-start": "237,204,232",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 6: จุดเริ่มต้น",
      "subtopic": "“ผมมั่นใจในความฝันของผมแล้ว นี่คือจุดเริ่มต้นของอนาคตผม ไม่สิ... ของเราทุกคน”",
      "description": "เคอิเพื่อนสนิทของคิรินถาม “เฮ้ คิริน เห็นยัง? มีมหาลัยจัด Hackathon ปีนี้นะ ธีมคือ ‘ความฝัน’ อยากลองอะไรใหม่ ๆ ปะ ถ้าสนใจ คิดชื่อทีมมาด้วยละกัน นี่ครั้งแรกของนายนี่”\n\nคิรินเลิกคิ้วเล็กน้อย “…ความฝัน?” เขาเงียบไปชั่วขณะ ภาพในฝันผุดขึ้นมาในหัวอย่างไม่รู้ตัว ทุ่งหญ้าที่มอดไหม้ ดวงตาของยานะที่มองมาที่เขา\n\nเขาหันไปสบตาเคอิ “…ส่งลิงก์ให้ฉันทีสิ”\n\nครั้งแรกในชีวิตที่เขาไม่ได้สมัครอะไรเพราะคนอื่นบอกให้ทำ แต่เขาอยากทำมันจริง ๆ\n\n“ว่าแต่ทำไมถึงตั้งชื่อทีมว่า Project: YANA ล่ะ” เคอิถามด้วยความสงสัย\n\nคิรินพูดพร้อมยิ้ม “มันก็แค่มาจากความฝันฉันน่ะ”"
    },
    {
      "chapter": "7",
      "img": "chapter7.webp",
      "background": "Scene7.webp",
      "radial-grad-start": "255,217,156",
      "radial-grad-end": "2,6,3",
      "linear-grad-start": "255,204,247",
      "linear-grad-end": "159,131,220",
      "topic": "บทที่ 7: คุณฝันว่าอะไร?",
      "subtopic": "“ชีวิต ความฝัน อนาคต สิ่งเหล่านี้เราทุกคนล้วนเป็นคนกำหนดมันด้วยตัวเอง”",
      "description": "คิรินรู้ว่ามันอาจจะเป็นแค่การแข่งขันเล็ก ๆ ในสายตาคนอื่น แต่สำหรับเขา… มันคือ ความฝันที่ยานะส่งต่อมาให้ และต่อจากนี้ไปมันก็จะกลายเป็นความฝันของตัวเขาเอง”\n\n“ผมไม่รู้หรอกว่าอนาคตจะมีอะไรรออยู่ หรือผมจะเปลี่ยนมันได้มั้ย แต่ผมจะทำให้เต็มที่ ทำตามความฝันของผม”\n\nเขายิ้มบาง ๆ พลางก้มลงพิมพ์โค้ดต่อด้วยหัวใจที่มั่นคงกว่าที่เคย\n\nนี่ไม่ใช่ความฝันของใครอีกแล้ว แต่เป็นความฝันของเขาเอง\n\nและคุณล่ะ… คุณฝันว่าอะไร?"
    }
  ]
}
